In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
date = pd.read_csv("C:/files/programming/Python/2025/jupyter/datasets/orders.csv",usecols=['date'])
time = pd.read_csv("C:/files/programming/Python/2025/jupyter/datasets/messages.csv")

In [3]:
date.head()

         date
0  2019-12-10
1  2018-08-15
2  2018-10-23
3  2019-08-17
4  2019-01-06

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

## Date

In [5]:
# converting into date time object
date['date'] = pd.to_datetime(date['date'], errors='coerce')

In [6]:
date['date_year'] = date['date'].dt.year
date.head()

        date  date_year
0 2019-12-10       2019
1 2018-08-15       2018
2 2018-10-23       2018
3 2019-08-17       2019
4 2019-01-06       2019

In [7]:
date['date_month'] = date['date'].dt.month_name()
# date['date_month'] = date['date'].dt.month
date.head()

        date  date_year date_month
0 2019-12-10       2019   December
1 2018-08-15       2018     August
2 2018-10-23       2018    October
3 2019-08-17       2019     August
4 2019-01-06       2019    January

In [8]:
date['date_day'] = date['date'].dt.day
date['date_day_name'] = date['date'].dt.day_name()

date.head()

        date  date_year date_month  date_day date_day_name
0 2019-12-10       2019   December        10       Tuesday
1 2018-08-15       2018     August        15     Wednesday
2 2018-10-23       2018    October        23       Tuesday
3 2019-08-17       2019     August        17      Saturday
4 2019-01-06       2019    January         6        Sunday

In [9]:
date['date_isweekend'] = np.where(date['date_day_name'].isin(['Sunday','Saturday']),1,0 )
date.head()

        date  date_year date_month  date_day date_day_name  date_isweekend
0 2019-12-10       2019   December        10       Tuesday               0
1 2018-08-15       2018     August        15     Wednesday               0
2 2018-10-23       2018    October        23       Tuesday               0
3 2019-08-17       2019     August        17      Saturday               1
4 2019-01-06       2019    January         6        Sunday               1

In [10]:
# quarter of year
date['date_quarter'] = date['date'].dt.quarter
date.head()

,date,date_year,date_month,date_day,date_day_name,date_isweekend,date_quarter
0,2019-12-10,2019,December,10,Tuesday,0,4
1,2018-08-15,2018,August,15,Wednesday,0,3
2,2018-10-23,2018,October,23,Tuesday,0,4
3,2019-08-17,2019,August,17,Saturday,1,3
4,2019-01-06,2019,January,6,Sunday,1,1

In [11]:
# week
date['date_week'] = date['date'].dt.isocalendar().week
date.head()

,date,date_year,date_month,date_day,date_day_name,date_isweekend,date_quarter,date_week
0,2019-12-10,2019,December,10,Tuesday,0,4,50
1,2018-08-15,2018,August,15,Wednesday,0,3,33
2,2018-10-23,2018,October,23,Tuesday,0,4,43
3,2019-08-17,2019,August,17,Saturday,1,3,33
4,2019-01-06,2019,January,6,Sunday,1,1,1

In [14]:
# semester
date['date_semester']=np.where(date['date_quarter'].isin([1,2]),1,2)
date.head()

,date,date_year,date_month,date_day,date_day_name,date_isweekend,date_quarter,date_week,date_semester
0,2019-12-10,2019,December,10,Tuesday,0,4,50,2
1,2018-08-15,2018,August,15,Wednesday,0,3,33,2
2,2018-10-23,2018,October,23,Tuesday,0,4,43,2
3,2019-08-17,2019,August,17,Saturday,1,3,33,2
4,2019-01-06,2019,January,6,Sunday,1,1,1,1

In [16]:
# extract time elapsed between dates

import datetime
today = datetime.datetime.today()
today

datetime.datetime(2026, 1, 19, 19, 19, 39, 621102)

In [18]:
(today - date['date']).dt.days

0      2232
1      2714
2      2645
3      2347
4      2570
       ...
995    2660
996    2601
997    2449
998    2514
999    2288
Name: date, Length: 1000, dtype: int64

In [23]:
# months passed

np.round( (today - date['date']) / np.timedelta64(1,'M'),0)

0      74.0
1      90.0
2      88.0
3      78.0
4      86.0
       ...
995    89.0
996    87.0
997    82.0
998    84.0
999    76.0
Name: date, Length: 1000, dtype: float64